# Ultralytics YOLOv5 🚀, AGPL-3.0 license
# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  [
    [-1, 1, SwinTransformerBlock, [3, 256, 128, 4, 7]],  # 0-P3/8
    [-1, 1, Conv, [256, 512, 3, 2]],  # 1-P4/16
    [-1, 3, C3, [512]],
    [-1, 1, Conv, [512, 1024, 3, 2]],  # 3-P5/32
    [-1, 1, C3, [1024]],
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, SPPF, [1024, 5]],  # 5

   [-1, 1, Conv, [1024, 512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [1024, 512, False]],  # 9

   [-1, 1, Conv, [512, 256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, 256, False]],  # 13 (P3/8-small)

   [-1, 1, Conv, [256, 256, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [768, 512, False]],  # 16 (P4/16-medium)

   [-1, 1, Conv, [512, 512, 3, 2]],
   [[-1, 6], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1536, 1024, False]],  # 19 (P5/32-large)

   [[13, 16, 19], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]